leetcode_344_reverse_string.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 344. Reverse String</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 344. Reverse String</h1>
<p>
You can solve this problem with two pointers: one starting from the begin of the array and other from the end.  Each iteration you swap the number from one side to the other until you reach the element on the middle of the array.  Time complexity is \(O(n)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">reverseString</span>(<span style="font-weight: bold;">self</span>, s: List[<span style="font-weight: bold;">str</span>]) -&gt; <span style="font-weight: bold; text-decoration: underline;">None</span>:
        <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">        Do not return anything, modify s in-place instead.</span>
<span style="font-style: italic;">        """</span>
        <span style="font-weight: bold; font-style: italic;">i</span> = 0
        <span style="font-weight: bold; font-style: italic;">j</span> = <span style="font-weight: bold;">len</span>(s) - 1
        <span style="font-weight: bold;">while</span> i &lt; <span style="font-weight: bold; font-style: italic;">j</span>:
            <span style="font-weight: bold; font-style: italic;">s</span>[<span style="font-weight: bold; font-style: italic;">i</span>], <span style="font-weight: bold; font-style: italic;">s</span>[<span style="font-weight: bold; font-style: italic;">j</span>] = s[j], s[i]
            <span style="font-weight: bold; font-style: italic;">i</span> += 1
            <span style="font-weight: bold; font-style: italic;">j</span> -= 1


<span style="font-weight: bold; font-style: italic;">v</span> = [<span style="font-style: italic;">"h"</span>, <span style="font-style: italic;">"e"</span>, <span style="font-style: italic;">"l"</span>, <span style="font-style: italic;">"l"</span>, <span style="font-style: italic;">"o"</span>]
Solution().reverseString(v)
<span style="font-weight: bold;">assert</span> v == [<span style="font-style: italic;">"o"</span>, <span style="font-style: italic;">"l"</span>, <span style="font-style: italic;">"l"</span>, <span style="font-style: italic;">"e"</span>, <span style="font-style: italic;">"h"</span>]

v = [<span style="font-style: italic;">"H"</span>, <span style="font-style: italic;">"a"</span>, <span style="font-style: italic;">"n"</span>, <span style="font-style: italic;">"n"</span>, <span style="font-style: italic;">"a"</span>, <span style="font-style: italic;">"h"</span>]
Solution().reverseString(v)
<span style="font-weight: bold;">assert</span> v == [
    <span style="font-style: italic;">"h"</span>,
    <span style="font-style: italic;">"a"</span>,
    <span style="font-style: italic;">"n"</span>,
    <span style="font-style: italic;">"n"</span>,
    <span style="font-style: italic;">"a"</span>,
    <span style="font-style: italic;">"H"</span>,
]
</pre>
</div>


<div id="outline-container-org1c73bbd" class="outline-2">
<h2 id="org1c73bbd">Cited by 1</h2>
<div class="outline-text-2" id="text-org1c73bbd">
<ul class="org-ul">
<li><a href="practice_004.html#ID-75F7DE70-9B14-4B4C-BC59-F1C463C06547">Practice #004</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>